In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
import warnings
warnings.filterwarnings('ignore')
# import mysql.connector as sql
import sqlite3

from sqlalchemy import create_engine

In [2]:
data_credit_score = pd.read_csv('./Data/credit_profiles.csv')
data_credit_score.head(4)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
0,1,749,0.585171,19571.0,0.0,40000.0
1,2,587,0.107928,161644.0,2.0,1250.0
2,3,544,0.854807,513.0,4.0,1000.0
3,4,504,0.336938,224.0,2.0,1000.0

In [4]:
data_credit_score.shape

(1004, 6)

In [ ]:
#### Check for duplicated,
##### check for nulls and see the best way to treat the nulls
##### check for outliars based on the BUSINESS or Stat Formulars

In [6]:
duplicates = data_credit_score.cust_id.duplicated().sum()
print("Number of duplicate rows:", duplicates)

Number of duplicate rows: 4

In [8]:
duplicates = data_credit_score.cust_id.duplicated().sum()
print("Number of duplicate rows:", duplicates)

Number of duplicate rows: 4

In [10]:
duplicate_rows = data_credit_score[data_credit_score.cust_id.duplicated()]
pd.DataFrame(duplicate_rows)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
517,517,308,0.113860,33.0,3.0,500.0
570,569,344,0.112599,37.0,0.0,500.0
608,606,734,0.193418,4392.0,1.0,40000.0
665,662,442,0.856039,266.0,2.0,500.0

In [20]:
duplicate_rows2 = data_credit_score[data_credit_score.cust_id.duplicated(keep=False)]
pd.DataFrame(duplicate_rows2)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
516,517,308,NaN,NaN,NaN,NaN
517,517,308,0.113860,33.0,3.0,500.0
569,569,344,NaN,NaN,NaN,NaN
570,569,344,0.112599,37.0,0.0,500.0
607,606,734,NaN,NaN,NaN,NaN
608,606,734,0.193418,4392.0,1.0,40000.0
664,662,442,NaN,NaN,NaN,NaN
665,662,442,0.856039,266.0,2.0,500.0

In [15]:
data_credit_score.credit_score.isnull().sum()

0

##### We drop the first row since they have NaN values

In [21]:
data_clean_credit_score = data_credit_score.drop_duplicates(subset="cust_id", keep="last")
data_clean_credit_score.shape

(1000, 6)

In [23]:
data_credit_score.shape[0],data_clean_credit_score.shape[0]

(1004, 1000)

In [30]:
data_credit_score.cust_id.duplicated().sum(),data_clean_credit_score.cust_id.duplicated().sum()

(4, 0)

##### Now Duplicatdes are removed lets check for Null Values

In [31]:
data_clean_credit_score.isnull().sum()

cust_id                            0
credit_score                       0
credit_utilisation                 0
outstanding_debt                   0
credit_inquiries_last_6_months     0
credit_limit                      65
dtype: int64

In [32]:
correlation_matrix = data_clean_credit_score.corr()
correlation_matrix

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
cust_id,1.000000,0.021562,0.000024,-0.024993,0.029721,0.022274
credit_score,0.021562,1.000000,-0.070445,0.306026,-0.001226,0.844279
credit_utilisation,0.000024,-0.070445,1.000000,0.046540,-0.013952,-0.084046
outstanding_debt,-0.024993,0.306026,0.046540,1.000000,0.034089,0.361906
credit_inquiries_last_6_months,0.029721,-0.001226,-0.013952,0.034089,1.000000,0.024669
credit_limit,0.022274,0.844279,-0.084046,0.361906,0.024669,1.000000

##### Generally, a correlation above 0.6 (or below -0.6) is considered a strong correlation
##### That being said credit_limit has a corrolation with  credit_score

In [33]:
data_clean_credit_score.credit_score.value_counts(dropna=False)

799    8
771    8
736    8
769    7
766    7
      ..
393    1
608    1
692    1
407    1
564    1
Name: credit_score, Length: 419, dtype: int64

In [35]:
data_clean_credit_score.credit_limit.value_counts(dropna=False)

500.0      229
60000.0    186
40000.0    137
1500.0     100
1000.0      90
750.0       76
1250.0      75
NaN         65
20000.0     42
Name: credit_limit, dtype: int64

In [34]:
data_clean_credit_score.credit_score

0       749
1       587
2       544
3       504
4       708
       ...
999     564
1000    774
1001    529
1002    725
1003    775
Name: credit_score, Length: 1000, dtype: int64

In [17]:
data_credit_score.cust_id.nunique()

1000

In [18]:
data_credit_score.shape

(1004, 6)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
516,517,308,NaN,NaN,NaN,NaN
517,517,308,0.113860,33.0,3.0,500.0
569,569,344,NaN,NaN,NaN,NaN
570,569,344,0.112599,37.0,0.0,500.0
607,606,734,NaN,NaN,NaN,NaN
608,606,734,0.193418,4392.0,1.0,40000.0
664,662,442,NaN,NaN,NaN,NaN
665,662,442,0.856039,266.0,2.0,500.0